[
  {
    "name": "Aspect Ratio",
    "filename": "AS_GFX_AspectRatio.1.fx",
    "type": "GFX",
    "shortDescription": "A versatile aspect ratio framing tool for subject positioning and composition.",
    "longDescription": "A versatile aspect ratio framing tool designed to help position subjects for social media posts, photography, and video composition. Features preset aspect ratios for common social media and photography formats (1:1, 16:9, 4:5, etc.), custom aspect ratio input, adjustable clipped area color and opacity, optional composition guides (rule of thirds, golden ratio, center lines), horizontal/vertical alignment controls, and adjustable border appearance. Perfect for precise subject positioning and consistent framing across platforms.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-aspectratio.gif"
  },
  {
    "name": "Audio Direction",
    "filename": "AS_GFX_AudioDirection.1.fx",
    "type": "GFX",
    "shortDescription": "Visualizes audio directionality as animated arrows or indicators, ideal for music-driven scenes or overlays.",
    "longDescription": "Displays animated arrows or indicators that visualize the directionality of audio sources in real time. Features customizable arrow count, size, color, and animation speed. Supports audio reactivity for direction, magnitude, and color. Useful for music visualizations, DJ overlays, or any scene where audio direction feedback is desired.",
    "imageUrl": null
  },
  {
    "name": "Blue Corona",
    "filename": "AS_BGX_BlueCorona.1.fx",
    "type": "BGX",
    "shortDescription": "Vibrant, abstract blue corona with fluid, dynamic motion and hypnotic, organic, plasma-like visuals. Customizable and audio-reactive.",
    "longDescription": "Creates a vibrant, abstract blue corona effect with fluid, dynamic motion. The effect generates hypnotic patterns through iterative mathematical transformations, resulting in organic, plasma-like visuals with a predominantly blue color scheme. Features abstract, organic blue corona patterns; smooth fluid-like animation; customizable iteration count/pattern scale; animation speed/flow controls; intuitive color controls; customizable background color; audio reactivity (multiple targets); depth-aware rendering; and standard position, rotation, scale, and blending options.",
    "credits": {
      "description": "Inspired by the 'Blue Corona [256 Chars]' shader by @SnoopethDuckDuck.",
      "externalUrl": "https://www.shadertoy.com/view/XfKGWV",
      "originalAuthor": "SnoopethDuckDuck",
      "originalTitle": "Blue Corona [256 Chars]"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-bluecorona.gif"
  },
  {
    "name": "Boom Sticker",
    "filename": "AS_VFX_BoomSticker.1.fx",
    "type": "VFX",
    "shortDescription": "Displays a texture overlay ('sticker') with controls for placement, scale, rotation, and audio reactivity.",
    "longDescription": "Displays a texture overlay ('sticker') with controls for placement, scale, rotation, and audio reactivity. Features customizable depth masking and support for custom textures. Ideal for adding dynamic, music-responsive overlays.",
    "credits": {
      "description": "Heavily inspired by 'StageDepth.fx' by Marot Satil (2019), original depth masking implementation.",
      "externalUrl": "https://github.com/Otakumouse/stormshade/blob/master/v4.X/reshade-shaders/Shader%20Library/Recommended/StageDepth.fx",
      "originalAuthor": "Marot Satil",
      "originalTitle": "StageDepth.fx"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-BoomSticker.gif"
  },
  {
    "name": "Brush Stroke",
    "filename": "AS_GFX_BrushStroke.1.fx",
    "type": "GFX",
    "shortDescription": "Transforms the scene with painterly brush stroke textures and dynamic, layered paint effects.",
    "longDescription": "Applies painterly brush stroke textures to the scene, simulating layered paint effects. Features customizable brush size, direction, density, and color blending. Includes animation controls for evolving brush patterns and supports palette-based colorization. Ideal for artistic transformations and stylized overlays.",
    "imageUrl": null
  },
  {
    "name": "Candle Flame",
    "filename": "AS_LFX_CandleFlame.1.fx",
    "type": "LFX",
    "shortDescription": "Simulates a realistic, animated candle flame with flicker, glow, and color controls.",
    "longDescription": "Renders a realistic animated candle flame with natural flicker and glow. Features customizable flame shape, color, flicker speed, and intensity. Includes controls for flame position, scale, and blending. Ideal for atmospheric lighting and cozy scene effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-Candle.gif"
  },
  {
    "name": "Cinematic Diffusion",
    "filename": "AS_GFX_CinematicDiffusion.1.fx",
    "type": "GFX",
    "shortDescription": "High-quality cinematic diffusion/bloom filter with 8 classic presets and a fully customizable mode.",
    "longDescription": "A high-quality cinematic diffusion/bloom filter that replicates classic film diffusion looks. Features 8 built-in presets (Pro-Mist, Hollywood Black Magic, etc.) and a fully customizable mode. Multi-pass downsampling ensures smooth, natural glows. Ideal for virtual photography and cinematic shots.",
    "imageUrl": null
  },
  {
    "name": "Circular Spectrum",
    "filename": "AS_VFX_CircularSpectrum.1.fx",
    "type": "VFX",
    "shortDescription": "Displays a circular audio spectrum analyzer with customizable bands, colors, and animation.",
    "longDescription": "Visualizes audio frequencies as a circular spectrum analyzer. Features adjustable band count, radius, thickness, color palette, and animation speed. Supports audio reactivity for dynamic, music-driven visuals. Ideal for overlays, music videos, and live performances.",
    "imageUrl": null,
    "credits": {
      "description": "Based on 'Circular audio visualizer' by AIandDesign.",
      "externalUrl": "https://www.shadertoy.com/view/tcyGW1",
      "originalAuthor": "AIandDesign",
      "originalTitle": "Circular audio visualizer"
    }
  },
  {
    "name": "Clair Obscur",
    "filename": "AS_VFX_ClairObscur.1.fx",
    "type": "VFX",
    "shortDescription": "Applies dramatic chiaroscuro lighting with strong contrast and stylized shadows.",
    "longDescription": "Simulates dramatic chiaroscuro (light-dark) lighting, emphasizing strong contrast and stylized shadows. Features controls for light direction, intensity, shadow softness, and color tint. Useful for artistic, cinematic, or moody scene transformations.",
    "credits": {
      "description": "Motion inspired by '[RGR] Hearts' by deeplo.",
      "externalUrl": "https://www.shadertoy.com/view/ttcBRs",
      "originalAuthor": "deeplo",
      "originalTitle": "[RGR] Hearts"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-ClairObscur.gif"
  },
  {
    "name": "Color Balancer",
    "filename": "AS_VFX_ColorBalancer.1.fx",
    "type": "VFX",
    "shortDescription": "Adjusts scene color balance with independent controls for shadows, midtones, and highlights.",
    "longDescription": "Provides precise color grading by adjusting the balance of shadows, midtones, and highlights independently. Features controls for lift, gamma, gain, and color wheels. Useful for creative color correction and stylized looks.",
    "imageUrl": null
  },
  {
    "name": "Constellation",
    "filename": "AS_BGX_Constellation.1.fx",
    "type": "BGX",
    "shortDescription": "Creates an animated stellar constellation pattern with twinkling stars and connecting lines. Perfect for cosmic, night sky, or abstract network visualizations with a hand-drawn aesthetic.",
    "longDescription": "Creates an animated stellar constellation pattern with twinkling stars and connecting lines. Perfect for cosmic, night sky, or abstract network visualizations with a hand-drawn aesthetic. Features dynamic constellation lines with customizable thickness and falloff; twinkling star points with adjustable sparkle properties; procedurally animated line connections; animated color palette with adjustable parameters; audio reactivity for zoom, gradient effects, line brightness, and sparkle magnitude; depth-aware rendering; and standard blend options.",
    "credits": {
      "description": "Based on the 'old joseph' effect by jairoandre.",
      "externalUrl": "https://www.shadertoy.com/view/slfGzf",
      "originalAuthor": "jairoandre",
      "originalTitle": "old joseph"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-constellation.gif"
  },
  {
    "name": "Corridor Travel",
    "filename": "AS_BGX_CorridorTravel.1.fx",
    "type": "BGX",
    "shortDescription": "Simulates an artistic flight through an abstract, glowing, patterned tunnel with pseudo-DOF, motion blur, and light bounce simulation.",
    "longDescription": "Simulates an artistic flight through an abstract, glowing, patterned tunnel. Features multiple samples per pixel for pseudo-DOF and motion blur, and simulates light bounces with artistic reflection logic.",
    "credits": {
      "description": "Inspired by the 'Corridor Travel' shader by NuSan.",
      "externalUrl": "https://www.shadertoy.com/view/3sXyRN",
      "originalAuthor": "NuSan",
      "originalTitle": "Corridor Travel"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-corridortravel.gif"
  },
  {
    "name": "Cosmic Kaleidoscope",
    "filename": "AS_BGX_CosmicKaleidoscope.1.fx",
    "type": "BGX",
    "shortDescription": "Renders a raymarched volumetric fractal (Mandelbox/Mandelbulb-like) with kaleidoscopic mirroring, audio reactivity, and palette-based coloring.",
    "longDescription": "Renders a raymarched volumetric fractal resembling a Mandelbox or Mandelbulb. Features Kaleidoscope-like mirroring effect with customizable repetitions, audio reactivity for dynamic parameter adjustments, palette-based coloring system with customizable options, and full rotation, position and depth control for scene integration.",
    "credits": {
      "description": "Inspired by 'Star Nest' from Kali",
      "externalUrl": "https://www.shadertoy.com/view/XlfGRj",
      "originalAuthor": "Kali",
      "originalTitle": "Star Nest"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-cosmickaleidoscope.gif"
  },
  {
    "name": "Digital Artifacts",
    "filename": "AS_VFX_DigitalArtifacts.1.fx",
    "type": "VFX",
    "shortDescription": "Simulates digital compression artifacts, blockiness, and color banding.",
    "longDescription": "Applies digital compression artifacts such as blockiness, color banding, and quantization noise. Features adjustable artifact strength, block size, and color depth. Useful for retro, glitch, or degraded video effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-digitalartifacts.gif"
  },
  {
    "name": "Digital Brain",
    "filename": "AS_BGX_DigitalBrain.1.fx",
    "type": "BGX",
    "shortDescription": "Abstract visualization of a digital brain neural network with animated Voronoi patterns, neural-like connections, and electrical pulses.",
    "longDescription": "Creates an abstract visualization of a 'digital brain' with evolving Voronoi patterns and neural-like connections. The effect simulates an organic electronic network with dynamic light paths that mimic neural activity in a stylized, technological manner. Features dynamic Voronoi-based pattern generation, animated 'electrical' pulses simulating synaptic activity, color modulation based on noise texture for organic variation, advanced vignette controls, pre-optimized pattern stretching, classic and texture-based coloring options, customizable animation and pattern controls, and depth-aware rendering with standard blending.",
    "credits": {
      "description": "Voronoi pattern logic inspired by 'Digital Brain' from srtuss.",
      "externalUrl": "https://www.shadertoy.com/view/4sl3Dr",
      "originalAuthor": "srtuss",
      "originalTitle": "Digital Brain"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-digitalbrain.gif"
  },
  {
    "name": "Dust Motes",
    "filename": "AS_VFX_DustMotes.1.fx",
    "type": "VFX",
    "shortDescription": "Adds floating dust motes and particles with customizable density, size, and animation.",
    "longDescription": "Simulates floating dust motes and particles drifting through the scene. Features controls for particle density, size, speed, color, and depth of field. Includes animation and blending options for subtle atmospheric enhancement.",
    "imageUrl": null
  },
  {
    "name": "Fluorescent",
    "filename": "AS_BGX_Fluorescent.1.fx",
    "type": "BGX",
    "shortDescription": "Creates a vibrant neon fluorescent background effect with raymarched volumetric patterns. Perfect for retro, cyberpunk, or futuristic atmospheres.",
    "longDescription": "Creates a vibrant neon fluorescent background effect that simulates the glow and intensity of fluorescent lighting. Perfect for creating retro, cyberpunk, or futuristic atmospheres with customizable colors and intensity. Features raymarched volumetric fluorescent effect with depth, dynamic color shifting with RGB phase controls, animated pulsing and flowing patterns, audio reactivity for rhythm-synchronized lighting, standard stage controls for positioning and depth, customizable iteration count for quality vs performance balance, and blend mode controls for integration with existing scenes.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-fluorescent.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/WcGGDd",
      "originalAuthor": "Xor",
      "originalTitle": "Fluorescent [292]"
    }
  },
  {
    "filename": "AS_VFX_FocusedChaos.1.fx",
    "type": "VFX",
    "name": "Focused Chaos",
    "shortDescription": "Swirling cosmic vortex/black hole effect with animated noise and artistic controls.",
    "longDescription": "Creates a visually complex and dynamic abstract effect resembling a focused point of chaotic energy or a swirling cosmic vortex. Patterns are generated using 3D Simplex noise and Fractional Brownian Motion (FBM), with colors evolving based on noise patterns and spatial coordinates, animated over time. Features transparent background, customizable animation, artistic controls for swirl/noise/color/alpha, dithering, domain warping, and standard AS-StageFX depth/blending controls.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/lcfyDj",
      "originalAuthor": "misterprada",
      "originalTitle": "BlackHole (swirl, portal)"
    }
  },
  {
    "name": "Golden Clockwork",
    "filename": "AS_BGX_GoldenClockwork.1.fx",
    "type": "BGX",
    "shortDescription": "Intricate, animated golden clockwork or Apollonian fractal patterns.",
    "longDescription": "Renders a mesmerizing and intricate animated background effect reminiscent of golden clockwork mechanisms or Apollonian gasket-like fractal patterns. The effect features complex, evolving geometric designs with a characteristic golden color palette. Features procedurally generated Apollonian fractal patterns, dynamic animation driven by time, a golden color scheme with lighting and shading effects, depth-like progression through fractal layers, kaleidoscopic and mirroring options for pattern variation, resolution-independent rendering, and UI controls for animation (speed, keyframe, path speed), palette, fractal/kaleidoscope parameters, audio reactivity, stage controls (position, scale, rotation, depth), and blending.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/WlcfRS",
      "originalAuthor": "mrange",
      "originalTitle": "Golden apollian"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-goldenclockwork.gif"
  },
  {
    "name": "Hand Drawing",
    "filename": "AS_GFX_HandDrawing.1.fx",
    "type": "GFX",
    "shortDescription": "Transforms the scene into a stylized hand-drawn sketch with distinct linework.",
    "longDescription": "Transforms your scene into a stylized hand-drawn sketch or technical ink illustration with distinct linework and cross-hatching patterns. Features sophisticated line generation with customizable stroke directions and length, textured fills based on original image colors with noise-based variation, animated 'wobble' effect for an authentic hand-drawn feel, optional paper-like background pattern, depth-aware rendering with standard blending, and comprehensive controls for fine-tuning every aspect of the effect. Perfect for artistic transformations, comic/manga styles, or technical illustrations.",
    "imageUrl": "https://github.com/user-attachments/assets/4074ac6b-a385-4e0f-9d9a-c4d5dd0117cd",
    "credits": {
      "description": "Based on 'notebook drawings' by Flockaroo (2016).",
      "externalUrl": "https://www.shadertoy.com/view/XtVGD1",
      "originalAuthor": "Flockaroo",
      "originalTitle": "notebook drawings"
    }
  },
  {
    "name": "Kaleidoscope",
    "filename": "AS_BGX_Kaleidoscope.1.fx",
    "type": "BGX",
    "shortDescription": "Creates a vibrant, ever-evolving fractal kaleidoscope pattern with animated tendrils. Perfect for psychedelic, cosmic, or abstract backgrounds with a hypnotic quality.",
    "longDescription": "Creates a vibrant, ever-evolving fractal kaleidoscope pattern with animated tendrils. Perfect for psychedelic, cosmic, or abstract backgrounds with a hypnotic quality. Features adjustable kaleidoscope mirror count for symmetry control; fractal zoom and pattern rotation with animation controls; customizable wave parameters and color palette; audio reactivity for zoom, wave intensity, and pattern rotation; depth-aware rendering; and standard blend options.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/ddsyDN",
      "originalAuthor": "Kanduvisla",
      "originalTitle": "Kaleidoscope"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-kaleidoscope.gif"
  },
  {
    "name": "Laser Show",
    "filename": "AS_LFX_LaserShow.1.fx",
    "type": "LFX",
    "shortDescription": "Projects animated laser beams and patterns with customizable color, speed, and audio reactivity.",
    "longDescription": "Projects animated laser beams and geometric patterns onto the stage. Features customizable beam count, color, speed, and spread. Supports audio reactivity for beam movement and intensity. Includes controls for rotation, position, and blending. Perfect for concert, club, or sci-fi lighting effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-lasershow.gif"
  },
  {
    "name": "Light Ripples",
    "filename": "AS_BGX_LightRipples.1.fx",
    "type": "BGX",
    "shortDescription": "Mesmerizing, rippling kaleidoscopic light patterns with customizable distortion, animation, color palettes, and audio reactivity.",
    "longDescription": "Creates a mesmerizing, rippling kaleidoscopic light pattern effect. Suitable as a dynamic background or overlay. Includes controls for animation, distortion (amplitude, frequencies), color palettes with cycling, audio reactivity, depth-aware rendering, adjustable rotation, and standard blending options.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/XsXXDn",
      "originalAuthor": "Danguafer/Danilo Guanabara",
      "originalTitle": "Creation by Silexars"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-lightripples.gif"
  },
  {
    "name": "Liquid Chrome",
    "filename": "AS_BGX_LiquidChrome.1.fx",
    "type": "BGX",
    "shortDescription": "Creates dynamic, flowing psychedelic patterns reminiscent of liquid metal or chrome, with optional vertical stripe overlays.",
    "longDescription": "Creates dynamic, flowing psychedelic patterns reminiscent of liquid metal or chrome. This shader iteratively distorts screen coordinates, creating complex, flowing patterns with optional vertical stripe overlays for additional visual texture.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-liquidchrome.gif",
    "credits": {
      "externalUrl": "https://neort.io/art/bkm813c3p9f7drq1j86g",
      "originalAuthor": "iamsaitam",
      "originalTitle": "Liquid Chrome"
    }
  },
  {
    "name": "Log Spirals",
    "filename": "AS_BGX_LogSpirals.1.fx",
    "type": "BGX",
    "shortDescription": "Creates an organic spiral pattern based on logarithmic growth with animated spheres along the spiral arms.",
    "longDescription": "Creates an organic spiral pattern based on logarithmic growth with animated spheres along the spiral arms. Features precise control over spiral expansion rate and animation, customizable sphere size with fade effects and specular highlights, color palette options with hue cycling and ambient glow, audio reactivity for multiple parameters (animation speed, rotation, arm twist, sphere size, brightness), and standard position/rotation/scale controls for scene integration.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-logspirals.gif",
    "credits": {
      "description": "Based on 'Logarithmic spiral of spheres' by mrange.",
      "externalUrl": "https://www.shadertoy.com/view/msGXRD",
      "originalAuthor": "mrange",
      "originalTitle": "Logarithmic spiral of spheres"
    }
  },
  {
    "name": "Melt Wave",
    "filename": "AS_BGX_MeltWave.1.fx",
    "type": "BGX",
    "shortDescription": "Flowing, warping psychedelic effect with sine-based distortions, palette system, keyframe animation, and audio reactivity.",
    "longDescription": "Creates a flowing, warping psychedelic effect inspired by 1970s visual aesthetics. Generates mesmerizing colored patterns with sine-based distortions that evolve over time. Features adjustable zoom/intensity, a palette system (mathematical or preset colors), dynamic time-based animation with keyframe support, audio reactivity mappable to different parameters, and resolution-independent transformation with position/rotation controls.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/XsX3zl",
      "originalAuthor": "tomorrowevening",
      "originalTitle": "70s Melt"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-meltwave.gif"
  },
  {
    "name": "Misty Grid",
    "filename": "AS_BGX_MistyGrid.1.fx",
    "type": "BGX",
    "shortDescription": "Abstract fractal-based grid background with a misty, ethereal appearance using raymarching. Audio-reactive and customizable.",
    "longDescription": "Creates an abstract fractal-based grid background with a misty, ethereal appearance using raymarching techniques. Features dynamic fractal-based grid environment, customizable colors with palette system, folding and repetition for complex patterns, camera movement simulation with smooth rotations, audio reactivity affecting multiple parameters (fractal scale, folding intensity, saturation, brightness, camera zoom, animation speed), and standard position/rotation/scale controls.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/wl2Szd",
      "originalAuthor": "NuSan",
      "originalTitle": "[twitch] Misty Grid"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-mistygrid.gif"
  },
  {
    "filename": "AS_VFX_MotionFocus.1.fx",
    "type": "VFX",
    "name": "Motion Focus",
    "shortDescription": "Automatic motion-based camera focus and zoom using inter-frame motion analysis.",
    "longDescription": "Analyzes inter-frame motion differences to dynamically adjust the viewport, zooming towards and centering on areas of detected movement. Uses a multi-pass approach to capture frames, detect motion, analyze motion distribution in quadrants, and apply a corresponding camera transformation with motion-centered zoom. Features multi-pass motion analysis, temporal smoothing, adaptive decay, quadrant-based aggregation, dynamic zoom/focus, and debug visualization."
  },
  {
    "name": "Motion Trails",
    "filename": "AS_VFX_MotionTrails.1.fx",
    "type": "VFX",
    "shortDescription": "Creates trailing motion blur effects for moving objects or the entire scene.",
    "longDescription": "Applies trailing motion blur to moving objects or the whole scene. Features adjustable trail length, direction, fade, and blending. Useful for simulating speed, action, or ghosting effects in dynamic scenes.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-motiontrails.gif"
  },
  {
    "name": "MultiLayer Halftone",
    "filename": "AS_GFX_MultiLayerHalftone.1.fx",
    "type": "GFX",
    "shortDescription": "Highly customizable multi-layer halftone (up to 4 layers) with various patterns, isolation methods, and blending options.",
    "longDescription": "Creates a highly customizable multi-layer halftone effect with support for up to four independent layers. Each layer can use different pattern types (dots, lines, crosshatch), isolation methods (brightness, RGB, hue, depth), colors, thresholds, scales, densities, and angles. Features layer blending with transparency support.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-multilayerhalftone.gif"
  },
  {
    "name": "Past Racer",
    "filename": "AS_BGX_PastRacer.1.fx",
    "type": "BGX",
    "shortDescription": "Raymarched abstract procedural scene (2 selectable) with domain repetition, custom transformations, and audio-reactive geometry/flares.",
    "longDescription": "A ray marching shader that generates one of two selectable abstract procedural scenes. Features domain repetition, custom transformations, and pseudo-random patterns. Scene geometry and flare effects can be reactive to audio frequency bands.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-pastracer.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/tsBBzG",
      "originalAuthor": "NuSan",
      "originalTitle": "Outline 2020 Freestyle Live code"
    }
  },
  {
    "name": "Plasma Flow",
    "filename": "AS_BGX_PlasmaFlow.1.fx",
    "type": "BGX",
    "shortDescription": "Sophisticated, gentle, flexible plasma effect with procedural noise, domain warping, and customizable audio-reactive color gradients.",
    "longDescription": "Sophisticated, gentle, and flexible plasma effect for groovy, atmospheric visuals. Generates smooth, swirling, organic patterns with customizable color gradients (2-4 user-defined colors) and strong audio reactivity. Features procedural plasma/noise with domain warping for fluid motion, controls for speed, scale, complexity, stretch, and warp, audio-reactive modulation of movement, color, brightness, and turbulence, plus standard blend modes and debug views. Ideal for music video backgrounds and overlays.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/slSBDd",
      "originalAuthor": "fuzzmoon",
      "originalTitle": "Plasma Storm"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-PlasmaFlow.gif"
  },
  {
    "name": "Protean Clouds",
    "filename": "AS_BGX_ProteanClouds.1.fx",
    "type": "BGX",
    "shortDescription": "Volumetric, evolving procedural clouds with raymarching, dynamic color, and realistic lighting.",
    "longDescription": "Renders dynamic, evolving volumetric clouds through raymarching techniques. Creates an immersive, abstract cloudscape with dynamic color variations and realistic lighting. Features high-quality volumetric cloud formations, customizable cloud density, shape, and detail, dynamic camera movement with adjustable path and sway, sophisticated internal lighting and self-shadowing, color palette system with customizable parameters, audio reactivity for multiple cloud parameters, and resolution-independent rendering with precise position controls.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-proteanclouds.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/3l23Rh",
      "originalAuthor": "nimitz",
      "originalTitle": "Protean clouds"
    }
  },
  {
    "name": "Quadtree Truchet",
    "filename": "AS_BGX_QuadtreeTruchet.1.fx",
    "type": "BGX",
    "shortDescription": "Multiscale recursive Truchet pattern with hierarchical tile overlaps, Art Deco line tiles, weave effects, and sophisticated palette system.",
    "longDescription": "Creates a sophisticated multiscale recursive Truchet pattern with hierarchical tile overlaps across 3 levels. Generates complex geometric designs through quadtree subdivision and probabilistic tile placement. Features quadtree-based recursive pattern generation, overlapping tile system with collision prevention, full AS palette system support with multiple color modes, Art Deco style with line tiles and weave effects, animated rotation and panning, audio reactivity for scale/rotation/seed/density, stage positioning controls, and debug visualization of the underlying quadtree structure.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-quadtreetruchet.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/4t3BW4",
      "originalAuthor": "Shane",
      "originalTitle": "Quadtree Truchet"
    }
  },
  {
    "filename": "AS_VFX_RadialLensDistortion.1.fx",
    "type": "VFX",
    "name": "Radial Lens Distortion",
    "shortDescription": "Emulates radial and lens-specific distortions including blur, chromatic aberration, and geometric warping.",
    "longDescription": "Simulates various lens distortions including tangential (rotational) blur, chromatic aberration (tangential or horizontal), and geometric barrel/pincushion distortion. Effects are strongest at the edges and diminish towards a configurable center point. Includes presets for emulating specific lens characteristics, plus global strength and focus falloff controls. Ensures consistent effect visibility regardless of source alpha by controlling alpha during blending."
  },
  {
    "name": "Radiant Fire",
    "filename": "AS_VFX_RadiantFire.1.fx",
    "type": "VFX",
    "shortDescription": "Simulates radiant, glowing fire with animated flames and color gradients.",
    "longDescription": "Generates radiant, glowing fire effects with animated flames and customizable color gradients. Features controls for flame shape, speed, intensity, and palette. Ideal for magical, fantasy, or atmospheric visuals.",
    "credits": {
      "description": "Flame generation inspired by '301's Fire Shader - Remix 3' by mu6k.",
      "externalUrl": "https://www.shadertoy.com/view/4ttGWM",
      "originalAuthor": "mu6k",
      "originalTitle": "301's Fire Shader - Remix 3"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-radiantfire.gif"
  },
  {
    "name": "Rainy Window",
    "filename": "AS_VFX_RainyWindow.1.fx",
    "type": "VFX",
    "shortDescription": "Simulates raindrops and streaks on a window with refraction and blur effects.",
    "longDescription": "Creates the illusion of raindrops and streaks running down a window, with realistic refraction and blur. Features adjustable rain density, drop size, streak speed, and blending. Perfect for moody, cinematic, or weather-themed scenes.",
    "credits": {
      "description": "Inspired by 'Heartfelt' by Martijn Steinrucken (BigWings).",
      "externalUrl": "https://www.shadertoy.com/view/ltffzl",
      "originalAuthor": "Martijn Steinrucken (BigWings)",
      "originalTitle": "Heartfelt"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-rainywindow.gif"
  },
  {
    "name": "Raymarched Chain",
    "filename": "AS_BGX_RaymarchedChain.1.fx",
    "type": "BGX",
    "shortDescription": "Raymarched animated chain of interconnected torus shapes following a procedural path. Features dynamic rotation, customizable geometry, and sophisticated lighting with camera controls.",
    "longDescription": "Renders a raymarched scene featuring an animated, endlessly twisting chain composed of interconnected torus shapes. The chain follows a procedurally defined path, and its segments rotate and evolve over time, creating a mesmerizing, complex visual. Features raymarched chain of torus shapes with procedural path animation, customizable animation speed and chain geometry, dynamic coloring based on raymarching depth and iteration, camera orientation controls, and standard AS-StageFX blending controls.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-raymarchedchain.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/ctSfRV",
      "originalAuthor": "Elsio",
      "originalTitle": "Corrente"
    }
  },
  {
    "name": "Screen Ring",
    "filename": "AS_VFX_ScreenRing.1.fx",
    "type": "VFX",
    "shortDescription": "Draws animated rings or circular overlays with customizable size, color, and animation.",
    "longDescription": "Draws animated rings or circular overlays on the screen. Features controls for ring count, size, thickness, color, and animation speed. Useful for HUDs, overlays, or stylized transitions.",
    "imageUrl": null
  },
  {
    "name": "Sparkle Bloom",
    "filename": "AS_VFX_SparkleBloom.1.fx",
    "type": "VFX",
    "shortDescription": "Adds sparkling bloom highlights with animated glints and color controls.",
    "longDescription": "Adds sparkling bloom highlights to bright areas, with animated glints and customizable color. Features controls for sparkle density, size, intensity, and animation. Ideal for magical, festive, or dreamy visuals.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-sparklebloom.gif"
  },
  {
    "name": "Spectrum Ring",
    "filename": "AS_VFX_SpectrumRing.1.fx",
    "type": "VFX",
    "shortDescription": "Visualizes audio spectrum as a ring with customizable bands, colors, and animation.",
    "longDescription": "Displays an audio spectrum analyzer in a ring format. Features adjustable band count, radius, thickness, color palette, and animation speed. Supports audio reactivity for dynamic, music-driven visuals. Ideal for overlays, music videos, and live performances.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-SpectrumRing.gif"
  },
  {
    "name": "Stage Spotlights",
    "filename": "AS_LFX_StageSpotlights.1.fx",
    "type": "LFX",
    "shortDescription": "Simulates moving stage spotlights with beam controls, color, and audio reactivity.",
    "longDescription": "Simulates moving stage spotlights with adjustable beam width, color, intensity, and movement patterns. Features multiple spotlights with independent controls, audio reactivity for movement and brightness, and blending options for integration with other effects. Ideal for live performance and dramatic scene lighting.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-Spotlights.gif"
  },
  {
    "name": "Stained Lights",
    "filename": "AS_BGX_StainedLights.1.fx",
    "type": "BGX",
    "shortDescription": "Dynamic, colorful patterns like stained glass with shifting light, blurred layers, and audio reactivity.",
    "longDescription": "Creates dynamic and colorful patterns reminiscent of stained glass illuminated by shifting light, with multiple blurred layers enhancing depth and visual complexity. Generates layers of distorted, cell-like structures with vibrant, evolving colors and subtle edge highlighting, overlaid with softer, floating elements. Features multi-layered pattern generation (adjustable iterations), dynamic animation with speed control, customizable pattern scaling/edge highlighting, audio reactivity for animation/pattern evolution, post-processing (curve adjustments, noise), blurred floating layers for depth, and depth-aware rendering with standard blending. Suitable for abstract backgrounds, energy fields, or mystical visuals.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/WlsSzM",
      "originalAuthor": "104",
      "originalTitle": "Stained Lights"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-stainedlights.gif"
  },
  {
    "name": "Stencil Mask",
    "filename": "AS_VFX_StencilMask.1.fx",
    "type": "VFX",
    "shortDescription": "Applies a stencil mask for selective effect application with shape and position controls.",
    "longDescription": "Applies a stencil mask to selectively reveal or hide parts of the scene. Features controls for mask shape, size, position, feathering, and blending. Useful for transitions, overlays, or compositing effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-StencilMask.gif"
  },
  {
    "name": "Sunset Clouds",
    "filename": "AS_BGX_SunsetClouds.1.fx",
    "type": "BGX",
    "shortDescription": "Raymarched volumetric clouds with animated turbulence and dynamic sunset coloring.",
    "longDescription": "Renders an animated scene of clouds at sunset using raymarching to create volumetric cloud effects with dynamic lighting and turbulence. Features raymarched volumetric clouds, animated turbulence effect, dynamic sunset coloring that changes over time, and tunable parameters for iterations, animation speed, and visual details.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-sunsetclouds.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/wXjSRt",
      "originalAuthor": "Xor",
      "originalTitle": "Sunset [280]"
    }
  },
  {
    "name": "Tilted Grid",
    "filename": "AS_VFX_TiltedGrid.1.fx",
    "type": "VFX",
    "shortDescription": "Draws a tilted, animated grid overlay with customizable angle, spacing, and color.",
    "longDescription": "Draws a tilted, animated grid overlay on the scene. Features controls for grid angle, spacing, line thickness, color, and animation speed. Useful for stylized overlays, retro visuals, or compositional guides.",
    "credits": {
      "externalUrl": "https://www.youtube.com/watch?v=Tfj6RDqXEHM",
      "originalAuthor": "FencerDevLog",
      "originalTitle": "Godot 4: Tilted Grid Effect Tutorial"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-tiltedgrid.gif"
  },
  {
    "name": "Time Crystal",
    "filename": "AS_BGX_TimeCrystal.1.fx",
    "type": "BGX",
    "shortDescription": "Hypnotic, crystalline fractal structure with dynamic animation, color cycling, and audio reactivity.",
    "longDescription": "Creates a hypnotic, crystalline fractal structure with dynamic animation and color cycling. Generates patterns reminiscent of crystalline structures or gems with depth and dimension. Features fractal crystal-like patterns (customizable iterations), dynamic animation (controllable speed), adjustable pattern density/detail, customizable color palettes with cycling, audio reactivity for pattern dynamics/colors, depth-aware rendering with standard blending, and adjustable position/rotation controls. Suitable for mystic or sci-fi backgrounds, portals, or energy fields.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/lcl3z2",
      "originalAuthor": "raphaeljmu",
      "originalTitle": "Time Crystal"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-timecrystal.gif"
  },
  {
    "name": "Vignette Plus",
    "filename": "AS_GFX_VignettePlus.1.fx",
    "type": "GFX",
    "shortDescription": "Advanced vignette effect with customizable shape, color, animation, blur, and audio reactivity.",
    "longDescription": "A vignette shader that provides multiple visual styles and customizable pattern options, creating directional, controllable vignette effects for stage compositions and scene framing. Perfect for adding mood, focus, or stylistic elements. Features four distinct visual styles (Smooth Gradient, Duotone Circles, Directional Lines perpendicular and parallel), multiple mirroring options (none, edge-based, center-based), precise control over effect coverage with start/end falloff points, and much more. Optimized for performance across various resolutions.",
    "credits": {
      "description": "Hexagonal grid implementation adapted from 'hexagonal wipe' by blandprix.",
      "externalUrl": "https://www.shadertoy.com/view/XfjyWG",
      "originalAuthor": "blandprix",
      "originalTitle": "Hexagonal Wipe"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-vignetteplus.gif"
  },
  {
    "name": "Volumetric Light",
    "filename": "AS_VFX_VolumetricLight.1.fx",
    "type": "VFX",
    "shortDescription": "Simulates volumetric light rays and god rays with customizable source, color, and intensity.",
    "longDescription": "Simulates volumetric light rays (god rays) emanating from a source. Features controls for light position, color, intensity, ray length, and blending. Useful for dramatic, atmospheric, or mystical scene lighting.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/wftXzr",
      "originalAuthor": "int_45h",
      "originalTitle": "fake volumetric 2d light wip"
    },
    "imageUrl": null
  },
  {
    "name": "Vortex",
    "filename": "AS_BGX_Vortex.1.fx",
    "type": "BGX",
    "shortDescription": "Psychedelic swirling vortex pattern with animated color, swirl, and brightness controls.",
    "longDescription": "Creates a psychedelic swirling vortex pattern. The effect is animated and features controls for color, animation speed, swirl characteristics, and brightness. Suitable as a dynamic background. Features animated vortex with customizable speed, palette-based coloring, swirl intensity/frequency/sharpness, brightness falloff, and standard AS-StageFX blending and positioning.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-vortex.gif",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/3fKGRd",
      "originalAuthor": "LonkDong",
      "originalTitle": "Vortex__ "
    }
  },
  {
    "name": "VUMeter",
    "filename": "AS_VFX_VUMeter.1.fx",
    "type": "VFX",
    "shortDescription": "Displays a classic VU meter with audio-reactive bars and customizable appearance.",
    "longDescription": "Displays a classic VU meter with audio-reactive bars. Features controls for bar count, orientation, color, peak hold, and animation. Ideal for music visualizations, overlays, and live performance feedback.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-VUMeter.gif"
  },
  {
    "name": "Warp Distort",
    "filename": "AS_VFX_WarpDistort.1.fx",
    "type": "VFX",
    "shortDescription": "Applies animated warp distortion with customizable strength, direction, and speed.",
    "longDescription": "Applies animated warp distortion to the scene. Features controls for distortion strength, direction, speed, and blending. Useful for psychedelic, dreamlike, or transition effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-Warp.gif"
  },
  {
    "name": "Water Surface",
    "filename": "AS_VFX_WaterSurface.1.fx",
    "type": "VFX",
    "shortDescription": "Simulates animated water surface with ripples, reflections, and customizable color.",
    "longDescription": "Simulates an animated water surface with dynamic ripples, reflections, and customizable color. Features controls for wave speed, amplitude, direction, and reflection intensity. Useful for aquatic, dreamy, or atmospheric effects.",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-watersurface.gif"
  },
  {
    "name": "Wavy Squares",
    "filename": "AS_BGX_WavySquares.1.fx",
    "type": "BGX",
    "shortDescription": "Hypnotic pattern of wavy, animated, transforming square tiles with dynamic size changes. Audio-reactive and depth-aware.",
    "longDescription": "Creates a hypnotic pattern of wavy, animated square tiles that shift and transform. The squares follow a wave-like motion and feature dynamic size changes, creating a flowing, organic grid pattern. Features wavy, undulating square tiling; customizable wave parameters (amplitude, frequency, speed); variable tile size/scaling; shape smoothness/box roundness controls; audio reactivity (multiple targets); depth-aware rendering; adjustable rotation; and standard position, scale, and blending options.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/NdfBzn",
      "originalAuthor": "SnoopethDuckDuck",
      "originalTitle": "Square Tiling Example E"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-wavysquares.gif"
  },
  {
    "name": "Wavy Squiggles",
    "filename": "AS_BGX_WavySquiggles.1.fx",
    "type": "BGX",
    "shortDescription": "Mesmerizing pattern of adaptive wavy lines forming intricate, rotating designs. Audio-reactive and depth-aware.",
    "longDescription": "Creates a mesmerizing pattern of adaptive wavy lines that follow a mouse or fixed position. The lines create intricate patterns that look like dynamic squiggly lines arranged around a central point, with rotation applied based on direction. Features position-reactive wavy line patterns; customizable line parameters (rotation influence, thickness, distance, smoothness); optional color palettes (hue, saturation, value control); pattern displacement for off-center effects; audio reactivity (multiple targets); depth-aware rendering; adjustable rotation; and standard position, scale, and blending options.",
    "credits": {
      "description": "Based on 'Interactive 2.5D Squiggles' by SnoopethDuckDuck.",
      "externalUrl": "https://www.shadertoy.com/view/7sBfDD",
      "originalAuthor": "SnoopethDuckDuck",
      "originalTitle": "Interactive 2.5D Squiggles"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-wavysquiggles.gif"
  },
  {
    "name": "Zippy Zaps",
    "filename": "AS_BGX_ZippyZaps.1.fx",
    "type": "BGX",
    "shortDescription": "Dynamic electric arcs/lightning patterns with procedural generation, audio reactivity, and 3D positioning.",
    "longDescription": "Creates dynamic electric arcs and lightning patterns for a striking background effect. This effect generates procedural electric-like patterns that appear behind objects in the scene, creating an energetic, dynamic background with complete control over appearance and animation. Features animated electric/lightning arcs with procedural generation; fully customizable colors, intensity, and animation parameters; resolution-independent rendering; audio reactivity; depth-aware rendering; and adjustable rotation/positioning in 3D space.",
    "credits": {
      "externalUrl": "https://www.shadertoy.com/view/XXyGzh",
      "originalAuthor": "SnoopethDuckDuck",
      "originalTitle": "Zippy Zaps"
    },
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-zippyzaps.gif"
  },
  {
    "filename": "AS_BGX_LightWall.1.fx",
    "type": "BGX",
    "imageUrl": "https://raw.githubusercontent.com/LeonAquitaine/as-stagefx/main/docs/res/img/as-stagefx-LightWall.gif"
  }
]
